//Напишите программу, которая на вход
//принимает число и выдаёт его квадрат (число
//умноженное на само себя).


int n = 15;
Console.WriteLine("Число: " + n);
Console.WriteLine("Квадрат числа: " + n * n);