//Напишите программу, которая на вход
//принимает число и выдаёт его квадрат (число
//умноженное на само себя).


Console.WriteLine("Введите число: ");
int n = int.Parse(Console.ReadLine());



Console.WriteLine("Число: " + n);
Console.WriteLine("Квадрат числа: " + Math.Pow(n, 2));